layers {
  bottom: "data"
  top: "Result"
  name: "Result"
  type: INNER_PRODUCT
  inner_product_param {
    num_output: 15
  }
}
layers {
  bottom: "Result"
  top: "prob"
  name: "Result.comput"
  type: SOFTMAX
}
input: "data"
input_dim: 1
input_dim: 4096
input_dim: 1
input_dim: 1
